/* Πρόβλημα:  Ζητείται να υλοποιηθεί μια συνάρτηση found η οποία δέχεται δύο συμβολοακολουθίες, text και word,
και επιστρέφει το πλήθος των εμφανίσεων της word στην text. Επίσης να αναπτυχτεί ένα πρόγραμμα το οποίο δέχεται
από το πληκτρολόγιο το όνομα ενός αρχείου κειμένου και την συμβολοακολουθία «computer» και τυπώνει στην οθόνη
το πλήθος των εμφανίσεων της τελευταίας στο αρχείο.
Θεωρείστε ότι η κάθε μία γραμμή του αρχείου κειμένου αποτελείται από το πολύ 80 χαρακτήρες.

Λύση: για την δημιουργία της συνάρτησης found πρέπει να δημιουργήσουμε ένα βρόγχο επανάληψης, ο οποίος θα επαναλαμβάνεται
για όσο δεν έχουμε συναντήσει το τέλος της ακολουθίας text. Κάθε φορά που θα εκτελείται θα φροντίζουμε
να κρατάμε τη θέση της text στην οποία ξεκινάμε το ψάξιμο.
Όσο δεν έχουμε συναντήσει το τέλος της text ούτε το τέλος της word και οι αντίστοιχοι χαρακτήρες είναι ίδιοι.
Αν συναντήσαμε το τέλος της text ή οι τελευταίοι χαρακτήρες δεν είναι ίδιοι συνεχίζουμε το ψάξιμο ξεκινώντας
από τον επόμενο χαρακτήρα στην text.

Έννοιες που συναντάμε: δείκτης, συνθήκη ελέγχου, βρόγχος επανάληψης, θέση μνήμης, διάβασμα αρχείου κειμένου
*/

#include <stdio.h>
#include <stdlib.h>

int found(char *text, char *word)
{
    int i,j,noerror,start;
    int times_found;
    i=0;
    times_found=0;
    while (*(text+i)!='\n') // όσο δεν έχουμε συναντήσει το τέλος της ακολουθίας text
    {
        j=0;
        noerror=1;
        start=i; // κρατάμε τη θέση της text στην οποία ξεκινάμε το ψάξιμο
        while ((*(text+i)!='\n') && (*(word+j)!='\0') && (noerror))
        // όσο δεν έχουμε συναντήσει το τέλος της text ούτε το τέλος της word και οι αντίστοιχοι χαρακτήρες // είναι ίδιοι
        {
            noerror=(text[i]==word[j]);
            i++;
            j++;
        }
        if ((*(word+j)=='\0') && (noerror))
        // αν συναντήσαμε το τέλος της word και οι τελευταίοι χαρακτήρες που ελέγξαμε είναι ίδιοι
        times_found++;
        else
        // αν συναντήσαμε το τέλος της text ή οι τελευταίοι χαρακτήρες δεν είναι ίδιοι συνεχίζουμε το
        // ψάξιμο ξεκινώντας από τον επόμενο χαρακτήρα στην text
        i=start+1;
    }
    return (times_found);
}

#define MAX_SIZE 80

main()
{
    char text[MAX_SIZE];
    char *word="computer";
    int times;
    FILE *fp;
    char fname[10];
    printf("Please enter a filename\n");
    scanf("%s",fname);

    fp=fopen(fname,"r");
    times=0;
    while (!feof(fp))
    {
        fgets(text, MAX_SIZE, fp);
        if (!feof(fp)) times=times+found(text,word);
    }
    printf("The word has been found %d times\n",times);
    system("pause");
}
