/************************************************************
 * ΠΛΗ10
 * Εισαγωγή στη γλώσσα προγραμματισμού C.
 *
 * 1o Αρχείο: 01_ascii.c
 *
 * Αυτό είναι το πρώτο πρόγραμμα προς επίδειξη. Ζητούμενο να
 * κατανοηθούν η βασική δομή ενός απλού προγράμματος C, καθώς
 * και οι συναρτήσεις printf() και scanf().
 *
 * Το πρόγραμμα ζητάει από το χρήστη έναν αριθμό ακέραιο από
 * το 0 έως το 255, και εμφανίζει στην οθόνη τον αντίστοιχο
 * ASCII χαρακτήρα.
 *
 * Στη παρούσα εκδοσή του, επιπλέον υπάρχει:
 * 1. επαναληπτική δομή ώστε να ζητά συνεχόμενα αριθμούς και να
 *    εμφανίζει ASCII χαρακτήρες έως ότου ο χρήστης πληκτρολογήσει 0.
 * 2. επαναληπτική δομή που να διασφαλίζει ότι ο αριθμός είναι
 *    μέσα στα επιθυμητά όρια (αμυντικός προγραμματισμός).
 * 3. μια επιπρόσθετη παράμετρος (%x) στην printf ώστε να εμφανίζεται
 *    και η δεκαεξαδική μορφή του αριθμού.
 *
 ************************************************************/

/*
 * Η παρακάτω γραμμή είναι απαραίτητη για τη σωστή εκτέλεση κάθε
 * C προγράμματος. Καθώς δεν είναι του παρόντος να κατανοήσετε την
 * πραγματική της λειτουργία, θεωρήστε την απλά μία "υποχρέωση".
 */

#include <stdio.h>

/*
 * Η συνάρτηση main() είναι το σημείο από όπου ξεκινά η εκτέλεση
 * του προγράμματός μας.
 */

main()
{
	int a;

	do {
      do {
         printf("Type a number from 0 to 255 [0 to stop]: ");
	     scanf("%d",&a);
	  /* Παρατηρήστε ότι για να ολοκληρωθεί σωστά η εισαγωγή πρέπει
	  * να περάσουμε σαν παράμετρο όχι το a αλλά το &a. Προς το
	  * παρόν θεωρήστε και αυτό σαν μια ακόμα "παραξενιά" της C
	  * αν και στο 3ο πρόγραμμα (03_pointer_example) θα εξηγήσουμε τον λόγο.
	  */
      } while (a<0 || a>255);
      /*
      * αμυντικός προγραμματισμός
      */


      printf("The ASCII character of the number : %d is %c and the hex value is %x\n",a, a, a);

	/* Εδώ βλέπετε ότι στην C μπορούμε να δείξουμε τα ίδια δεδομένα
	 * με διαφορετικούς τρόπους χωρίς να αλλοιώσουμε τα ίδια τα δεδομένα.
	 * Στην πρώτη αναφορά στην μεταβλητή a στην οθόνη εμφανίζεται ένας
	 * δεκαδικός, καθώς αναφερόμαστε σε αυτήν ως ακαέραιο αριθμό (%d).
	 * Στη δεύτερη εμφανίζεται ο αντίστοιχος ASCII χαρακτήρας καθώς
	 * χρησιμοποιούμε το %c. Στη τρίτη εμφανίζεται ο αντίστοιχος δεκαεξαδικός
     * χαρακτήρας καθώς χρησιμοποιούμε το %x.
     * Σημείωση: Οι χαρακτήρες που αντιστοιχούν στις τιμές 0 μέχρι 31 του πίνακα
     * ASCII είναι χαρακτήρες ελέγχου, και δεν είναι εκτυπώσιμοι.
	 */
    } while (a);
    /*
    * επαναλήψεις όσο η μεταβλητή a είναι διάφορη του μηδενός
    *
    * Θα μπορούσε να γραφεί η συνθήκη και ως while (a),
    * χωρίς δηλαδή την ανισότητα,
    * γιατί στη C ο μόνος αριθμός που θεωρείται τιμής FALSE είναι το 0.
    */

    //system("pause");
    /*
    * Αν χρησιμοποιείτε τον Dev C++ v5.5.3, η εντολή αυτή δεν χρειάζεται.
	* Η system("pause") επιτρέπει να διαβάσουμε τι γράφει το παράθυρο αποτελεσμάτων.
    * Αν δεν υπήρχε, τότε το παράθυρο θα άνοιγε και θα έκλεινε πολύ γρήγορα.
    * Εμφανίζει τη γραμμή "Πιέστε ένα πλήκτρο για συνέχεια . . ."
    */
}
