/************************************************************
 * ΠΛΗ10 
 * Εισαγωγή στη γλώσσα προγραμματισμού C.
 * 
 * 4o Αρχείο: 04_pointer_array_i.c
 *
 * Αυτό είναι το τέταρτο πρόγραμμα προς επίδειξη. Ζητούμενο να 
 * κατανοηθούν βασικά θέματα πινάκων και δεικτών. 
 * Στο πρόγραμμα δείχνουμε αναλυτικά: 
 * - Δήλωση δισδιάστατων πινάκων
 * - ο βασικός βρόχος for
 * - η break
 * - Η ισοδυναμία δείκτη και πίνακα στη C
 *
 ************************************************************/
 
#include <stdio.h>


/* Με την παρακάτω γραμμή δηλώνουμε στη C έναν δισδιάστατο πίνακα από int, 4 x 12
 */

int array[4][12];

int *p;
int tmp;

char a;

int main()
{
	int i,j;

	/* Η βασική εντολή της C που αντιστοιχεί στην ΓΙΑ ...ΕΩΣ ... ΕΠΑΝΕΛΑΒΕ
	 * είναι η for( A ; B ; C ) όπου A είναι η συνθήκη αρχικοποίησης, Β η 
	 * συνθήκη επανάληψης και C η συνθήκη βήματος. Η γραμμή for(i=0;i<4;i++)
	 * ερμηνεύεται ως εξής: "αρχικοποίησε την μεταβλητή i σε 0 και όσο η i είναι 
	 * μικρότερη από 4, εκτέλεσε το βρόχο και στη συνέχεια αύξησε την i κατά 1"
	 * Στη συνέχεια δίνουμε ένα χαρακτηριστικό διπλό βρόχο που αρχικοποιεί όλα 
	 * τα στοιχεία του πίνακα. Θα παρατηρήσετε ότι τα i και j παίρνουν τιμές από 
	 * το 0. ΣΤΗ C OI ΠΙΝΑΚΕΣ ΞΕΚΙΝΟΥΝ ΠΑΝΤΑ ΑΠΟ ΤΗ ΘΕΣΗ 0! 
	 *
	 */
	for(i=0;i<4;i++)
		for(j=0;j<12;j++)
			array[i][j] = j + 100*(i+1);

	/* Και με αυτό το διπλό βρόχο θα εκτυπώσουμε τα στοιχεία του πίνακα. Μετά το 
	 * τέλος κάθε εκτέλεσης ενός εσωτερικού βρόχου εκτυπώνουμε το χαρακτήρα 
	 * αλλαγής γραμμής για να φαίνονται τα δεδομένα μας πιο κατανοητά στην οθόνη.
	 */
	for(i=0;i<4;i++)
	{
		for(j=0;j<12;j++)
			printf("%d ",array[i][j]);
		printf("\n");
	}
	a = getchar();

	/* Τώρα, θα δοκιμάσουμε να ανταλλάξουμε τα στοιχεία του πίνακα συμμετρικά, δηλαδή το 
	 * στοιχείο [0][0] να πάει στη θέση [3][11] (μην ξεχνάτε ότι ξεκινάμε την αρίθμηση από 
	 * το 0) κ.ο.κ. Ο παρακάτω κώδικας περνά από όλα τα στοιχεία του πίνακα και τα αλλάζει
	 * με το συμμετρικό τους.
	 */
	for(i=0;i<4;i++)
		for(j=0;j<12;j++)
			{
				tmp = array[i][j];
				array[i][j] = array[3-i][11-j];
				array[3-i][11-j] = tmp;

			}

	a = getchar();


	printf("\n");
	/* Ας εκτυπώσουμε πάλι τον πίνακα να δούμε το αποτέλεσμα...
       */
	for(i=0;i<4;i++)
	{
		for(j=0;j<12;j++)
			printf("%d ",array[i][j]);
		printf("\n");
	}
	a = getchar();
      /* Γιατί όμως ο πίνακας είναι πάλι ίδιος? Προφανώς, γιατί αναμεταθέσαμε κάθε στοιχείο 
       * δύο φορές και με τον τρόπο αυτό το επαναφέραμε στην αρχική του θέση! Για να το αναμεταθέσουμε
       * μόνο μία φορά, αρκεί να εκτελέσουμε τις αναμεταθέσεις μέχρι το μέσο του πίνακα.
       * Υπάρχουν πολλοί τρόποι για να γίνει αυτό. Ο πιο προφανής τρόπος είναι να εκτελείται για 
       * i από 0 έως 3 και j από 0 έως 5. Θα δούμε όμως έναν διαφορετικό τρόπο, χρησιμοποιώντας την 
       * εντολή break. Η break στη C όταν εκτελείται, διακόπτει και τερματίζει άμεσα τον βρόχο που
       * εκτελείται εκείνη τη στιγμή. Αν η εντολή βρίσκεται ενφωλιασμένη σε περισσότερους βρόχους, 
       * τότε θα διακόψει τον πλέον εσωτερικό από τους βρόχους αυτούς και μόνο αυτόν. 
       * Στον παρακάτω κώδικα, η break θα σταματήσει την εκτέλεση του for(j=0;j<12;j++)και θα 
       * συνεχίσει την εκτέλεση του εξωτερικού βρόχου for(i=0;i<4;i++), αυξάνοντας κατά 1 το i. 
	   * Έτσι, θα έχουμε το επιθυμητό αποτέλεσμα.....
       */
	
	for(i=0;i<4;i++)
		for(j=0;j<12;j++)
			{
				tmp = array[i][j];
				array[i][j] = array[3-i][11-j];
				array[3-i][11-j] = tmp;
				if(j>4)
					break;

			}

	a = getchar();
	/* Ας εκτυπώσουμε πάλι τον πίνακα να δούμε το αποτέλεσμα...
       */
	for(i=0;i<4;i++)
	{
		for(j=0;j<12;j++)
			printf("%d ",array[i][j]);
		printf("\n");
	}

	a = getchar();

	printf("\n");
      /* Ας δούμε όμως τώρα πως σχετίζονται στη C οι πίνακες με τους δείκτες. 
       * ΣΤΗ C Η ΔΗΛΩΣΗ ΔΕΙΚΤΗ ΚΑΙ Η ΔΗΛΩΣΗ ΠΙΝΑΚΑ ΕΙΝΑΙ ΙΣΟΔΥΝΑΜΕΣ. Για το λόγο αυτό η παρακάτω
       * περίεργη σε πρώτη όψη ανάθεση είναι απόλυτα σωστή !
       * Με το (int *) διασφαλίζουμε ότι ο δείκτης array δείχνει σε τύπο int όπως και ο p
       */
       
	p = (int *) array;

	/* Με τη δήλωση αυτή εξισώνουμε έναν δείκτη με έναν πίνακα? Στην πραγματικότητα, βάζουμε στη
       * μεταβλητή p τη διεύθυνση του πρώτου στοιχείου του πίνακα! Για να το δούμε: αφού η array είναι 
       * μεταβλητή, λογικά η διεύθυνσή της θα δίνεται από την &array.... 
       * Όμως, θα δείτε ότι η παραπάνω έκφραση δημιουργεί Λάθος ή προειδοποίηση στον compiler. Και 
       * αυτό γιατί η array είναι ήδη δείκτης, είναι δηλαδή η διεύθυνση στην οποία αποθηκεύεται το 
       * πρώτο στοιχείο του πίνακα. 
       */ 

	printf(" array is placed at position %d, p contains %d and the value there is %d\n",array, p, *p);

	/* Πως όμως μπορούμε να προσπελάσουμε τα υπόλοιπα στοιχεία του πίνακα? Απλά! Το πρώτο στοιχείο του 
     * πίνακα είναι στη διεύθυνση p+0, το δεύτερο στοιχείο είναι στη θέση p+1, το τρίτο στην 
     * p+2 κ.ο.κ.  Αντίστοιχα, τα περιεχόμενα του πίνακα είναι τα *(p+0), *(p+1), *(p+2) ...
	 * Ο παρακάτω κώδικας δείχνει όλα τα στοιχεία του πίνακα χωρίς να χρησιμοποιήσει τη μεταβλητή 
     * array...
     */
	a = getchar();

	for(i=0;i<4*12;i++)
	{
		if(i%12 == 0)
			printf("\n");

		printf("%d ", *(p+i));
	}
	printf("\n");	
system("pause");
}



