/************************************************************
* ΠΛΗ10
* Εισαγωγή στη γλώσσα προγραμματισμού C.
* 
* 7o Αρχείο: 07_login.c
*
* Αυτό είναι το έβδομο πρόγραμμα προς επίδειξη. Το πρόγραμμα 
* υλοποιεί ένα απλό στατικό σύστημα login.
* Στο πρόγραμμα παρουσιάζεται αναλυτικά 
*	- Η χρήση της εντολής precompiler #define 
*	- H στατική αρχικοποίηση πινάκων 
*	- Η χρήση της Α?Β:C
*
 ************************************************************/
 
#include <stdio.h>
#include <string.h>

/* Στο πρόγραμμα θεωρούμε ότι έχουμε 10 ζευγάρια login names και passwords
 * και στα ζευγάρια αυτά αναζητούμε το ταίριασμα με τις τιμές που θα 
 * πληκτρολογήσει ο χρήστης. Θα μπορούσαμε, και θα ήταν εξίσου σωστό, να 
 * χρησιμοποιήσουμε τον αριθμό 10 κάθε φορά που στον κώδικα έπρεπε να αναφερθούμε 
 * σε κάτι σχετικό με τον αριθμό των εγγραφών. Όμως, αν αργότερα θέλαμε να δοκιμάσουμε 
 * με διαφορετικό αριθμό λογαριασμών, έστω 20, θα έπρεπε να αλλάξουμε τον αριθμό αυτό 
 * σε κάθε σημείο που τον χρησιμοποιήσαμε. Πιθανότατα βέβαια σε ένα πιο πολύπλοκο 
 * πρόγραμμα να μην θυμόμασταν όλες τις αναφορές και να κάναμε λάθη. 
 * Για να λύσουμε το παραπάνω πρόβλημα χρησιμοποιούμε την εντολή του precompiler
 * #define.  
 * Η εντολή αυτή απλά αντικαθιστά την εμφάνιση του πρώτου αλφαριθμητικού με το δεύτερο, 
 * πριν από την εκτέλεση του προγράμματος. Με την παρακάτω κλήση, κάθε εμφάνιση της λέξης 
 * ACCOUNTS στο πρόγραμμα θα αντικατασταθεί με τον αριθμό 10 πριν την έναρξη της 
 * μετάφρασης. Έτσι, για να αλλάξουμε τον αριθμό των λογαριασμών, αρκεί να αλλάξουμε 
 * την αναφορά σε ένα μόνο σημείο, δηλαδή #define ACCOUNTS 20
 */

#define ACCOUNTS	10


/* Έδώ μπορείτε να δείτε μια τυπική στατική αρχικοποίηση ενός δισδιάστατου πίνακα. 
 * κάθε μία από τις ACCOUNTS γραμμές του πίνακα αποτελείται από 100 χαρακτήρες. 
 * Με τον παρακάτω κώδικα αρχικοποιούμε κάθε τέτοια εκατοντάδα με ένα string. 
 * Στη συγκεκριμένη περίπτωση οι τρείς τελευταίες εγγραφές αρχικοποιούνται με το κενό 
 * string.
 */

char accounts[ACCOUNTS][100] = 	{
									"root","John","Maria","projects","guests","administrator","web_server","","",""
								};
char passwords[ACCOUNTS][100] = {
									"qwerty","r","cvgtr","12345678","guests","myadmin","__%%23ab","","",""
								};

char tmpac[100];
char tmppw[100];
char *p;
int found = 0;

main()
{

	int i;

	/* Βγάλτε τον παρακάτω κώδικα από τα σχόλια και τρέξτε τον μια φορά αν θέλετε 
	 * να δείτε τα ζευγάρια login - password
	 * Παρατηρήστε τον τρόπο με τον οποίο γίνεται έλεγχος ώστε να εμφανίζεται 
	 * παύλα στην περίπτωση κενού string: Χρησιμοποιούμε τον έλεγχο A?B:C 
	 * Στην συγκεκριμένη περίπτωση, την πρώτη φορά που το χρησιμοποιούμε το A
	 * αντιστοιχεί στο accounts[i][0]=='\0'	 δηλαδή στον έλεγχο για το αν ο 
	 * πρώτος χαρακτήρας του i string είναι 
	 * χαρακτήρας τερματισμού. Με βάση τον ορισμό της συγκεκριμένης εντολής, σε περίπτωση 
	 * που η έκφραση είναι αληθής, αντικαθίσταται από το Β, στην περίπτωσή μας το string "-",
	 * ενώ σε διαφορετική περίπτωση από το C που αντιστοιχεί στο string accounts[i]. 
	 */
//	for(i=0;i<ACCOUNTS;i++)
//		printf("User %d: %s \tpassword %s\n",i,accounts[i][0]=='\0'?"-":accounts[i],passwords[i][0]=='\0'?"-":passwords[i]);
//	printf("\n\n****************************\n\n");

	while(!found)
	{
		p = tmpac;
		printf("login:");
		p=gets(p);

		p = tmppw;
		printf("password:");
		p=gets(p);

		for(i=0;i<ACCOUNTS;i++)
		{
			if(accounts[i][0]!='\0' && !strcmp(tmpac,accounts[i]) && !strcmp(tmppw,passwords[i]))
			{
				printf("\nWelcome!\n");
				found = 1;
				break;
			}
		}
		if(found == 0)
			printf("\nLogin error, try again...\n");

	}
system("pause");
}
