/************************************************************
* ΠΛΗ10
* Εισαγωγή στη γλώσσα προγραμματισμού C.
* 
* 11o Αρχείο: 11_min_max.c
*
* Αυτό είναι το ενδέκατο πρόγραμμα προς επίδειξη. Το πρόγραμμα 
* παρουσιάζει τον τρόπο με τον οποίο μπορούμε να βρούμε τον μεγαλύτερο  
* και τον μικρότερο από μία σειρά αριθμών που δίνονται από το πληκτρολόγιο
*
 ************************************************************/
 
 #include <stdio.h>

main()
{
	double x, max, min; //Δήλωση μεταβλητών
	int maxpos, minpos, plithos;

	scanf("%lf", &x);
	max=x; min=x; maxpos=1; minpos=1; plithos=0;
	while (x != -999.9) //συνθήκη while η οποία ελέγχει κάθε φορά την τιμή του x και για όσο δεν είναι -999.9 επαναλαμβάνει την διαδικασία
	{
		plithos++;

		if (x > max) //έλεγχος της τιμής του x αν ξεπερνά την τιμή της μεταβλητής max
		{
			max=x;
			maxpos=plithos;
		}
		if (x< min) //έλεγχος της τιμής του x αν είναι μικρότερο από την τιμή της μεταβλητής min
		{
			min=x;
			minpos=plithos;
		}

		scanf("%lf", &x);
	}
	if (plithos > 0)
	{
		printf("Max %lf Pos %d\n",max,maxpos);
		printf("Min %lf Pos %d\n",min,minpos);
	}
}

