/************************************************************
* ΠΛΗ10
* Εισαγωγή στη γλώσσα προγραμματισμού C.
* 
* 12o Αρχείο: 12_pinakas.c
*
* Αυτό είναι το δωδέκατο πρόγραμμα προς επίδειξη. Το πρόγραμμα 
* παρουσιάζει βασικά θέματα των πινάκων, όπως διαπέραση, και θέση στοιχείου 
*************************************************************/
 
#include <stdio.h>
#define N 20 // Δήλωση σταθεράς Ν (μέγιστο πλήθος των στοιχείων του πίνακα)
main()
{
	int t[N], plithos, x, i, j, k; // Δήλωση μεταβλητών και του βασικού πίνακα
	plithos=0;
	for (i=0; i<N; i++) // εντολή επανάληψης for, επαναλαμβάνεται τόσες φορές όσες είναι ο πίνακας
	{
		scanf("%d", &x);
		if (plithos == 0) /// έλεγχος αν είναι ο πίνακας κενός
		{
			t[plithos]=x;
			plithos++;  // αύξηση του μετρητή των στοιχείων
		}
		else // Αν είναι οποιοδήποτε εκτός του πρώτου στοιχείου που εισάγεται
		{
			j=0;
			while ((x < t[j]) && (j < plithos - 1)) //επειδή ο πίνακας πρέπει να ταξινομηθεί με φθίνουσα σειρά  ψάχνουμε το στοιχείο που είναι πλησιέστερα 
                                                    //του δοθέντος ξεκινώντας από το μεγαλύτερο και προχωρώντας προς το μικρότερο καθώς πάμε απο τα αριστερά 
                                                    //προς τα δεξιά. Έτσι βρίσκουμε το πλησιέστερο σε αυτό σημείο.
				j++; // αύξηση του δείκτη της θέσης
			if (x < t[j]) // έλεγχος εαν το στοιχείο που εισήχθη είναι μικρότερο του πιο κοντινού σε αυτό στοιχείου
			{
				t[plithos]=x;
				plithos++;
			}
			else
				if (x > t[j]) // Αν είναι μεγαλύτερο
				{
					for (k=plithos;k>j;k--) //τότε σπρώχνει προς τα δεξιά τα υπόλοιπα μικρότερα από αυτό στοιχεία
						t[k]=t[k-1];
					t[j]=x;
					plithos++;
				}
				else // Αν είναι ίσο με την τιμή του στοιχείου που βρήκαμε, τότε εμφανίζει την θέση του
					printf("%d exists in pos %d\n", x, j);
		}
	}
	for (i=0;i < plithos; i++)
		printf("%d\n",t[i]); // Εκτυπώνουμε τον ταξινομημένο σε φθίνουσα σειρά πίνακα
}
