/***************************************************************************** 
 * ΠΛΗ10 
 * Εισαγωγή στη γλώσσα προγραμματισμού C.
 * 
 * 17o Αρχείο: 17_recursion_factorial.c
 *
 * Αυτό είναι το δέκατο έβδομο πρόγραμμα προς επίδειξη.
 * Παράδειγμα χρήσης Αναδρομής, Υπολογισμός παραγοντικού
 * Αναδρομική συνάρτηση είναι η συνάρτηση που καλεί τον εαυτό της.
 * Στα μαθηματικά, το παραγοντικό ενός θετικού ακέραιου n, συμβολίζεται με n!
 * Είναι το γινόμενο όλων των θετικών ακεραίων μικρότερων ή ίσων με n.
 * Για παράδειγμα 5! = 5 * 4 * 3 * 2 * 1 = 120
 * Μη αναδρομικός υπολογισμός: n! = n*..*3*2*1
 * 
 * Αναδρομικός υπολογισμός: n! = n * (n-1)!
 * Iσχύει ότι 1! = 1
 * 
 * Επιπλέον: - δημιουργία ακέραιας συνάρτησης - επιστρoφή ακέραιας τιμής
 *           - χρήση παραμέτρων (πέρασμα με τιμή) σε συνάρτηση
 ****************************************************************************/


#include<stdio.h>

/* Δηλώσεις συναρτήσεων 
* Οι πλήρεις συναρτήσεις βρίσκονται μετά την main()
*/
int input();
/*
* Συνάρτηση που ζητάει από το χρήστη έναν ακέραιο. 
* Το int πριν από το όνομα δηλώνει ότι το αποτέλεσμα
* της συνάρτησης είναι ένας ακέραιος (που επιστρέφει στην 
* συνάρτηση main() που την καλεί)
*
* Δεν έχει ορίσματα η συνάρτηση αυτή
*/

int paragontiko(int);
/*
* Συνάρτηση που υπολογίζει το παραγοντικό ενός αριθμού. 
* Έχει ακέραιο όρισμα η συνάρτηση, αφού εντός των
* παρενθέσεων υπάρχει int
*/

void print(int);
/*
* Συνάρτηση που εμφανίζει έναν αριθμό. 
* Έχει ακέραιο όρισμα η συνάρτηση, αφού εντός των
* παρενθέσεων υπάρχει int
* Το void δηλώνει ότι η συνάρτηση δεν επιστρέφει καμία τιμή
* στην συνάρτηση main() που την καλεί)
*/


main(){

	int n, result;

	n=input();
	// κλήση της input()
	// η μεταβλητή n υποδέχεται το αποτέλεσμα της συνάρτησης

	result=paragontiko(n);
	/* κλήση της paragontiko()
	   η μεταβλητή result υποδέχεται το αποτέλεσμα της συνάρτησης
     
       εναλλακτικά: οι 2 προηγούμενες εντολές
       μπορούν να δωθούν ως μια:
      	      result=paragontiko(input());             
       το αποτέλεσμα της input() χρησιμοποιείται ως όρισμα 
       στη συνάρτηση paragontiko().
       Γίνεται, αφού υπάρχει συμβατότητα στο τύπο 
       (ακέραια συνάρτηση προσφέρει ακέραιο όρισμα)
    */
	
    print(result);
    // κλήση της print()
	// είναι void, δεν χρειάζεται να υποδεχτούμε 
    // κάποιο αποτέλεσμα από αυτήν
    
system("pause");
}

int input(){
	int k;
	
    /* Με την do-while έλέγχουμε αν ο χρήστης δίνει θετικό αριθμό
    * Η δομή επαναληψης θα συνεχίζεται μέχρι ο χρήστης να δώσει αποδεκτό αριθμό
    * Αμυντικός προγραμματισμός
    */
	do{
	  printf("Dwse to n (megalitero tou 0): ");
	  scanf("%d",&k);
	}
    while(k<=0);

	
    return k;
    /* πρέπει μια συνάρτηση με τύπο να επιστρέφει με return
       κάποιο συγκεκριμένο αποτέλεσμα
       Η μεταβλητή k είναι ακέραια, οπότε υπάρχει συμβατότητα
       με το τύπο int της συνάρτησης
    */ 
}

/* Η Συνάρτηση paragontiko() είναι αναδρομική συνάρτηση
 * Μέσα στο κώδικά που περιέχει, καλεί τον εαυτό της
 * κανοντας χρήση της μεταβλητής n με βήμα μείωσης (n-1)
 * Καποιου είδους βήμα είναι πάντα απαραίτητο
 * ώστε να μην οδηγηθούμε σε ατέρμονη επανάληψη
 */

// η πλήρης συνάρτηση paragontiko
int paragontiko(int n){

	if(n==1)
		return 1;
	else
		return n*paragontiko(n-1);

}

// η πλήρης συνάρτηση print()
void print(int x){

	printf("\nTo apotelesma einai: %.d\n",x);

}
