/***************************************************************************** 
 * ΠΛΗ10 
 * Εισαγωγή στη γλώσσα προγραμματισμού C.
 * 
 * 18o Αρχείο: 18_srand.c
 *
 * Αυτό είναι το δέκατο όγδοο πρόγραμμα προς επίδειξη.
 * Παραγωγή Τυχαίων Αριθμών
 * Ζάρια
 * Ημερομηνία και Ώρα συστήματος
 * Συναρτήσεις rand(), srand() και time()
 *
 * Επιπλέον: - δημιουργία ακέραιας συνάρτησης - επιστρoφή ακέραιας τιμής
 *           - χρήση παραμέτρων (πέρασμα με τιμή) σε συνάρτηση
 ****************************************************************************/

#include<stdio.h>

// H συνάρτηση rand() ανήκει στην βιβλιοθήκη stdlib.h
#include<stdlib.h>

// Η συνάρτηση time() ανήκει στην βιβλιοθήκη time.h
#include<time.h>




/* Δηλώσεις δυο συναρτήσεων 
* Οι πλήρεις συναρτήσεις βρίσκονται μετά την main()
*/
int throwDice();
void check(int,int);

main(){

	int dice1,dice2;
	
    // ειδικός τύπος μεταβλητής για μέτρηση χρόνου
    time_t result;

    
    // εμφάνιση ημερομηνίας και ώρας  
    result = time(NULL);
    printf(asctime(localtime(&result)));

  
  /* H συνάρτηση rand() επιστρέφει έναν τυχαίο ακέραιο αριθμό στο διάστημα 
  * [0,32767] και ορίζεται ως int rand(void);
  * Η συνάρτηση rand() παράγει πάντα (σε όλες τις εκτελέσεις ενός προγράμματος) 
  * την ίδια ακολουθία τυχαίων αριθμών (ψευδοτυχαίοι)
  * Κάνοντας χρήση της συνάρτησης srand(), επεμβαίνουμε στο 'σπόρο' - γεννήτρια 
  * των τυχαίων. 
  * Έτσι, βάζοντας στην srand() όρισμα την συνάρτηση time(NULL), η οποία 
  * επιστρέφει την ημερομηνία και ώρα του συστήματος κάθε χρονική στιγμή, 
  * παράγουμε τελικά διαφορετική ακολουθία τυχαίων αριθμών κάθε φορά
  */
	srand(time(NULL));
	
	
	dice1=throwDice();
	dice2=throwDice();
    // κλήση της συνάρτησης 2 φορές και υποδοχή των επιστροφών της (ακέραιοι) σε
    // δυο ακέραιες μεταβλητές

	check(dice1,dice2);
	/*έλεγχος αν ήρθαν διπλές
	*
	* Η συνάρτηση δέχεται ως ορίσματα τους 2 τυχαίους που παρήχθησαν
	* Δεν επιστρέφει τίποτε - η ίδια εμφανίζει το κατάλληλο μήνυμα
	*/
	
system("pause");
}

int throwDice(){
	printf("\nRipsi zariou");

/* Για την παραγωγή τυχαίων αριθμών σε ορισμένο διάστημα [a,b]
 * Χρησιμοποιούμε την έκφραση rand() % (b-a+1)+a
 */
	return rand()%(6-1+1)+1; 
    // το υπόλοιπο της διαίρεσης του τυχαίου rand() με το 6 είναι από 0..5
    // με την πρόσθεση της μονάδας έχουμε ως δυνατές τιμές τις 1..6
    // αυτές δηλαδή που χρειαζόμαστε για τα ζάρια
}

void check(int x, int y){

	if(x==y)
		printf("\nBravo !!! Eferes diples!\n%d %d\n",x,y);
	else
		printf("\nEferes\n%d %d\n",x,y);
}
