/***************************************************************************** 
 * ΠΛΗ10 
 * Εισαγωγή στη γλώσσα προγραμματισμού C.
 * 
 * 19o Αρχείο: 19_synParamSyn.c
 *
 * Αυτό είναι το δέκατο ένατο πρόγραμμα προς επίδειξη.
 * Συνάρτηση ως Παράμετρος Συνάρτησης
 * Ένα ισχυρό χαρακτηριστικό της C: Δείκτης σε συνάρτηση
 * 
 * H συνάρτηση check() ελέγχει για τις δύο πρώτες παραμέτρους της a και b, 
 * αν είναι είτε αλφαβητικά ίσες (χρήση strcmp()) είτε αριθμητικά ίσες
 * (χρήση numcmp()). Αυτό γίνεται μέσω της τρίτης της παραμέτρου 
 * που είναι η συνάρτηση σύγκρισης.
 *
 * Με την συνάρτηση check(), έχουμε τη δυνατότητα να 'αδιαφορούμε' για 
 * τους μη-αριθμητικούς χαρακτήρες που βρίσκονται στο τέλος δυο
 * εκφράσεων που θέλουμε να συγκρίνουμε ως αριθμούς.  
 *
 * Συναρτήσεις tolower(), strcmp(), atoi()
 *****************************************************************************/

#include <stdio.h>

#include <stdlib.h>   
//  για την atoi()   

#include <ctype.h> 
//  για την tolower()

#include <string.h>   
// για την strcmp()  


void check( char *a, char *b, int (*cmp) () )  {
	// 
    
    printf("Checking ...");
	if ( !(*cmp) (a,b) )
		printf(" equal \n\n ");
	else 	printf(" NOT equal \n\n");
}

/*
* Η numcmp(), όπως και η strcmp(), επιστρέφει 0 όταν οι παράμετροι είναι ίσοι 
* και 1 όταν είναι άνισοι. Παρατηρήστε τον τρόπο που περνάμε τα αλφαριθμητικά 
* σαν παραμέτρους συναρτήσεων. Δεν διαφέρει από όσα αναφέραμε για τους πίνακες 
* άλλων τύπων. Εξακολουθούμε δηλαδή να προτιμούμε δείκτες (pointers).
*/
int numcmp( char *a, char *b )
{	if ( atoi(a) == atoi(b) ) return 0;
	/* Η συνάρτηση atoi() μετατρέπει το string που δέχεται ως παράμετρο 
    * σε integer. Πως γίνεται η μετατροπή; Αν ο πρώτος χαρακτήρας δεν είναι 
    * ψηφίο ή πρόσημο, τότε η μετατροπή σταματάει και το αποτέλεσμα είναι 0. 
    * Αλλιώς ένα-ένα τα ψηφία περνούν και η μετατροπή σταματάει στο πρώτο 
    * χαρακτήρα που δεν είναι ψηφίο. 
    * Π.χ. atoi("ed234")=>0, atoi("15x4d")=>15, atoi("-3.4qw")=>-3 
    */
    else return 1;	
}

main()
{  
   char st1[80], 	st2[80] ;
   printf("Dvste 2 ekfraseis (strings) gia sygkrisi \n");
   printf(" (an kai oi 2 arxizoun me psifio,\n");
   printf("  i sygkrisi tha einai arithmitiki)\n"); 
   printf("************************************\n\n");
   
   printf("1h: ");  gets(st1); 
   printf("2h: ");	gets(st2);
   
  if ( (tolower(*st1) <= 'z' && tolower(*st1) >= 'a')
    || (tolower(*st2) <= 'z' && tolower(*st2) >= 'a'))
     /* Η tolower() δέχεται παράμετρο τύπου char και επιστρέφει τον 
     * αντίστοιχο πεζό χαρακτήρα. Αν η παράμετρος δεν είναι κάποιος κεφαλαίος 
     * χαρακτήρας τότε δεν τον αλλάζει καθόλου.
     *
     * EAN ο πρώτος χαρακτήρας είτε του πρώτου string st1 είτε του δεύτερου 
     * string st2 είναι ένα από τα γράμματα του αγγλικού αλφάβητου, κεφαλαίο ή 
     * μικρό, τότε επειδή είδαμε ότι η atoi() δίνει 0, χρειαζόμαστε σύγκριση 
     * αλφαβητική μέσω της γνωστής strcmp().
     */
     {   printf("SYGKRINONTAI OS STRINGS: xrisi tis strcmp()\n");
	     check(st1, st2, strcmp);
	 }
	else {  
         printf("SYGKRINONTAI OS ARITHMOI : xrisi tis numcmp()\n");
         printf("(lamvanontai ypopsin oi arxikoi xaraktires-psifia\n"); 
         printf(" eos ton proto mi-arithmitiko xaraktira)\n\n");   
	     check(st1, st2, numcmp);
		 }	
         /*
         * Αλλιώς όταν η πρώτη θέση και των δύο string περιέχει ψηφίο, 
         * τότε η atoi() κάνει τις μετατροπές και ζητείται αριθμητική σύγκριση 
         * μέσω της numcmp() που εμείς φτιάχνουμε. 
         *
         * Έτσι, μπορεί να γίνει (αριθμητική) σύγκριση με βάση τους αρχικούς 
         * μη-αλφαβητικούς χαρακτήρες των εκφράσεων 
         *(π.χ. το 123t θεωρείται ίσο με το 123 
         */	
 system("pause");
 }
