/***************************************************************************** 
 * ΠΛΗ10 
 * Εισαγωγή στη γλώσσα προγραμματισμού C.
 * 
 * 20o Αρχείο: 20_matrix_function.c
 *
 * Αυτό είναι το εικοστό πρόγραμμα προς επίδειξη.
 * Πρόβλημα: Δυναμική διαχείριση μνήμης. Στο δυναμικό καταμερισμό μνήμης κατά τη διάρκεια της εκτέλεσης δεσμεύονται
 * τμήματα μνήμης από τον σωρό, χρησιμοποιούνται και απελευθερώνονται όταν δε χρειάζονται
 * Λύση: Η χρήση της malloc() δεσμεύει από το σωρό ένα τμήμα μνήμης μεγέθους σε bytes και επιστρέφει τη διεύθυνση της
 * πρώτης θέσης μνήμης του block που δέσμευσε. Αν η δέσμευση μνήμης αποτύχει επιστρέφεται NULL.
 * Παράδειγμα: p=(char *) malloc(8);
 * Έννοιες που συναντάμε: malloc()

 *****************************************************************************/


#include <stdio.h>

int **ftiakse_pinaka(int seira, int stili)
{
	int *stoixeia_pinaka;
	int **seires_pinaka;
	

	/* Πρώτα δεσμεύουμε χώρο για όλα τα στοιχεία του πίνακα */
	stoixeia_pinaka = (int*)malloc(seira*stili*sizeof(int));

	if (stoixeia_pinaka == NULL)
	{
		return NULL;
	}

	/* Μετά δεσμεύουμε χώρο για τις σειρές */	
	seires_pinaka = (int**)malloc(seira*sizeof(int*));
	if (seires_pinaka == NULL)
	{
		free(stoixeia_pinaka);	/* Εφόσον η δέσμευση για τις */
								/* σειρές απέτυχε ο χώρος για τα */
								/* στοιχεία δεν μας είναι χρήσιμος */
		return NULL;				
	}
	
	
	/* Τέλος φορτώνουμε τον πίνακα seires_pinaka με την διεύθυνση των κατάλληλων στοιχείων */
	
	int i;
	for (i=0;i<seira;i++)
	{
		seires_pinaka[i] = &stoixeia_pinaka[stili*i];
	}

	/* Επιστροφή του πίνακα - ΠΡΟΣΟΧΗ εκεί που γίνεται η δήλωση του δείκτη που παραλαμβάνει */
	/* τον πίνακα πρέπει να γίνει και η free() ώστε να ελευθερωθεί ο δεσμευμένος χώρος όταν */
	/* πάψει να είναι χρήσιμος */
	return seires_pinaka;

	
}

/* Η συνάρτηση main εδώ παίζει το ρόλο "συνάρτησης οδηγού"(driver function)*/
int main()
{
	int c = 3;
	int r = 3;

	int **Matrix;
	// δυναμική δέσμευση του χώρου που καταλαμβάνει ο πίνακας
	Matrix = ftiakse_pinaka(r,c);

   // πλέον μπορεί να χρησιμοποιηθεί κανονικά για ανάθεση και ανάγνωση τιμών
	Matrix[1][2] = 5;
   printf("Timi pinaka sti thesi 1,2: %d\n", Matrix[1][2]);
   system("pause");
}	
