/*****************************************************************************
 * ΠΛΗ10 
 * Εισαγωγή στη γλώσσα προγραμματισμού C.
 * 
 * 23o Αρχείο: 23_enosi.c
 *
 * Αυτό είναι το εικοστό τρίτο πρόγραμμα προς επίδειξη.  
 * Μια ένωση μπορεί να θεωρηθεί ως ένα είδος μεταβλητής που μπορεί να περιέχει πολλές διαφορετικές μεταβλητές (όπως μια δομή), 
 * αλλά στην πραγματικότητα μπορεί να περιέχει μόνο μία από αυτές σε μια δεδομένη στιγμή (διαφορετικά από μια δομή). 
 * Μπορούμε να φανταστούμε μια ένωση ως ένα διαμοιραζόμενο κομμάτι μνήμης που μπορεί να χρησιμοποιηθεί για την αποθήκευση μεταβλητών 
 * διαφόρων τύπων. Μόλις όμως μια νέα τιμή ανατεθεί σε ένα πεδίο, τα υπάρχοντα δεδομένα των υπόλοιπων πεδίων 'σκεπάζονται' από τα νέα δεδομένα.
 * Το μέγεθος μιας ένωσης είναι ίσο με το μέγεθος του μεγαλύτερου μέλους της.
 * Με άλλα λόγια, ο C compiler διαθέτει τόσο χώρο όσο χρειάζεται το μεγαλύτερο μέλος της.
 * Αυτό συμβαίνει επειδή μόνο ένα μέλος μπορεί να χρησιμοποιηθεί ανά πάσα στιγμή. 
 ****************************************************************************/

#include <stdio.h>
#include <stdlib.h>

int main()
{
    system("chcp 1253>nul");
    union data
    {

        char a;
        int x;
        float f;

    } myData;

        int mode;
printf("Επίδειξη δομής union με πεδία char, int και float  \n");
printf("==================================================\n");
do {
do {
  printf("Θα χρησιμοποιήσετε char (1), int (2) ή float(3); (έξοδος με 0): ");
  scanf("%d", &mode);
} while ((mode<0) || (mode>3));

printf("\n");
switch (mode) {
       case 1: 
           printf("Χρήση char\n");
           myData.a = 'A';
           printf("Εισαγωγή 'A' στο 1ο πεδίο char. \nData:\n%c\n%i\n%.3f\n\n", myData.a, myData.x, myData.f );
           break;
       case 2:
           printf("Χρήση int\n");
           myData.x = 42;
           printf("Εισαγωγή 42 στο 2ο πεδίο int. \nData:\n%c\n%i\n%.3f\n\n", myData.a, myData.x, myData.f );
           break;
       case 3:
            printf("Χρήση float\n"); 
            myData.f = 101.357;
            printf("Εισαγωγή 101.357 στο 3ο πεδίο float. \nData:\n%c\n%i\n%.3f\n\n", myData.a, myData.x, myData.f );
            break;
       case 0: exit;
       }
} while (mode != 0);    
  system("pause");
 return 0;
}
