/*****************************************************************************
 * ΠΛΗ10 
 * Εισαγωγή στη γλώσσα προγραμματισμού C.
 * 
 * 24o Αρχείο: 24_zaria.c
 *
 * Αυτό είναι το εικοστό τέταρτο πρόγραμμα προς επίδειξη.
 * Πρόβλημα: Εισαγωγή σε πίνακα τυχαίων αριθμών, πλήθους και εύρους τιμών οριζόμενων από το χρήστη.
 * Λύση: Ο χρήστης 'ρίχνει' ευέλικτου τύπου 'ζάρια': μπορεί να επιλέξει το πλήθος των πλευρών
 * που μπορεί να έχουν τα ζάρια, καθώς και το πλήθος των ζαριών. 
 * H συνάρτηση rand() επιστρέφει έναν τυχαίο ακέραιο αριθμό στο διάστημα [0,32767] και ορίζεται ως int rand(void); 
 * Χρησιμοποιείται η συνάρτηση rand(), η οποία παράγει πάντα (σε όλες τις εκτελέσεις ενός προγράμματος) την ίδια ακολουθία 
 * τυχαίων αριθμών (ψευδοτυχαίοι). Για αυτό το λόγο, στην αρχή, κάνουμε χρήση της συνάρτησης srand(), 
 * βάζοντας το χρήστη να επιλέξει-επέμβει στο 'σπόρο' - γεννήτρια των τυχαίων αριθμών. 
 * Έννοιες που συναντάμε: Ορισμός και κλήση συνάρτησης, δομή επανάληψης, συναρτήσεις rand(), srand() και time().
 *****************************************************************************/

#include <stdio.h>
#include <string.h>
#include <stdlib.h>

#define SCALE 32768.0
#define N 10




int rollem(int sides)
{
        float roll;

        roll = ( (float) rand() / SCALE + 1.0 ) * sides / 2.0 + 1.0;
        return ( (int) roll);
}

main()            
{
        system("chcp 1253>nul");
        int dice, count, roll, seed;
        int sides;               /*   Πλήθος πλευρών */
        int timi[N];
        /* H συνάρτηση rand() επιστρέφει έναν τυχαίο ακέραιο αριθμό στο διάστημα [0,32767] και ορίζεται 
         ως int rand(void); Η συνάρτηση rand() παράγει πάντα (σε όλες τις εκτελέσεις ενός προγράμματος) 
         την ίδια ακολουθία τυχαίων αριθμών (ψευδοτυχαίοι). Κάνοντας χρήση της συνάρτησης srand(), 
         επεμβαίνουμε στο 'σπόρο' - γεννήτρια των τυχαίων αριθμών. */
        printf("Δώστε μια τιμή για την αρχικοποίηση - γεννήτρια των τυχαίων αριθμών: ");
        scanf("%d", &seed);
        srand(seed);
        
        printf("\nΔώστε αριθμό πλευρών (από 1 έως %d) ανά ζάρι\n (τιμή εκτός ορίων οφηγεί στο τερματισμό): ", N);
        scanf("%d", &sides);
        while (sides > 0 && sides < 10)
        {
                printf("Πόσα ζάρια;\n");
                scanf("%d", &dice);
                for ( roll = 0, count = 1; count <= dice; count++)
                        {
                            timi[count-1]=rollem(sides);
                            roll += timi[count-1];
                        }     
                printf("Φέρατε %d, χρησιμοποιώντας %d ζάρια των ", roll, dice);
                printf("%d πλευρών\n", sides);
                printf("Τα ζάρια ήταν: ");
                for (count=0; count< dice; count++)
                   printf(" %d", timi[count]);
                   
                printf("\n\nΔώστε αριθμό πλευρών (από 1 έως %d) ανά ζάρι\n (τιμή εκτός ορίων οφηγεί στο τερματισμό): ", N);
                scanf("%d", &sides);
        }
        printf("Τέλος εκτέλεσης\n");
        system ("pause");
}







