/*****************************************************************************
 * ΠΛΗ10 
 * Εισαγωγή στη γλώσσα προγραμματισμού C.
 * 
 * 25o Αρχείο: 25_pseudo.c
 *
 * Αυτό είναι το εικοστό πέμπτο πρόγραμμα προς επίδειξη.
 * Πρόβλημα: Μπορούμε να γράψουμε πρόγραμμα C, χρησιμοποιώντας εντολές που 
 * προσομοιάζουν με τις εντολές ψευδοκώδικα; Ναι, μπορούμε !!!
 * Λύση: Δημιουργία εξωτερικού αρχείου/βιβλιοθήκης με το όνομα alias.h, 
 * στο οποίο γίνεται χρήση της #define με σκοπό την αλλαγή των εντολών 
 * της γλώσσας C, σε μια μορφή πιο οικεία, κοντά στην καθομιλουμένη γλώσσα. 
 * Έννοιες που συναντάμε: Η οδηγία προεπεξεργαστή #define.
 ****************************************************************************/
 
#include "alias.h"
PROGRAMMA
ARXH
        SYSTHMA("chcp 1253>nul");
        AKERAIOI yours,mine;
        
        EMFANISE("C σαν ... ψευδοκώδικας\n");
        EPANALAVE 
        ARXH
          EMFANISE("Δώστε έναν αριθμό μεγαλύτερο του 10: ");
          DIAVASE("%d", &yours);
        TELOS
        MEXRI (yours<=10);
        mine = yours * 2;
        EMFANISE("%d είναι το διπλάσιο του αριθμού σου\n", mine);
        EAN (mine>50) 
             EMFANISE("... και είναι μεγαλύτερο του 50\n");
        ALLIOS
             EMFANISE("... και ΔΕΝ είναι μεγαλύτερο του 50\n");
        SYSTHMA("pause");
TELOS
