/*****************************************************************************
 * ΠΛΗ10 
 * Εισαγωγή στη γλώσσα προγραμματισμού C.
 * 
 * 27o Αρχείο: 27_pointer_array.c
 *
 * Αυτό είναι το εικοστό έβδομο πρόγραμμα προς επίδειξη.
 * Πρόβλημα: Ζητούμενο της άσκησης είναι να γραφεί μια συνάρτηση table_reverse 
 * η οποία θα δέχεται έναν πίνακα χαρακτήρων (συμβολοσειρά)
 * και θα τον αντιστρέφει χρησιμοποιώντας δείκτες (pointers).
 * Λύση: Αφού δηλωθούν οι μεταβλητές δεικτών και εισαχθεί ο πίνακας χαρακτήρων,
 * εκτελούμε μία συνθήκη ελέγχου (while) η οποία με διαδοχικές επαναλήψεις
 * ψάχνει να βρει το τέλος της συμβολοσειράς. Έπειτα πρέπει να ελεγχθεί 
 * αν ο πίνακας έχει τουλάχιστον ένα στοιχείο ή είναι κενός και με την βοήθεια 
 * των δεικτών q και p αντιστρέφουμε τον πίνακα. Πιο συγκεκριμένα, ο δείκτης p
 * διατρέχει τον πίνακα από αριστερά και ο q από δεξιά.
 * Έννοιες που συναντάμε: δείκτης, συνθήκη ελέγχου, βρόγχος επανάληψης, συμβολοσειρά
 ****************************************************************************/
 
#include<stdio.h>
#include <stdlib.h>
void table_reverse(char a[]);

main(){
       char pinax[7] = "Toyota";
       table_reverse(pinax);
       system("PAUSE");


}

void table_reverse(char a[])
{
 char *p,*q, temp;
 int i=0;

 p=a;

 while ((*p)!='\0') // ψάχνουμε το τέλος του πίνακα
 {
  p++;
 }

 if (p != a) // ο πίνακας έχει τουλάχιστον 1 στοιχείο
  q=p-1;
 else // ο πίνακας δεν έχει στοιχεία
  q=p;

 p=a; // ο δείκτης p διατρέχει τον πίνακα από αριστερά και ο q από δεξιά
 while (p < q)
 {
  temp= *p;
  *p=*q;
  *q=temp;
  p++;
  q--;
 }

 for(i=0;i<6;i++)
 {
                    printf("%c", a[i]);
    }

}

///OUTPUT: atoyoT:Press any key to continue . . .
