/*****************************************************************************
 * ΠΛΗ10 
 * Εισαγωγή στη γλώσσα προγραμματισμού C.
 * 
 * 29o Αρχείο: 29_pseudo.c
 *
 * Αυτό είναι το εικοστό ένατο πρόγραμμα προς επίδειξη.
 * Πρόβλημα: Πρόβλημα: Να αναπτυχτεί πρόγραμμα που να δέχεται από το χρήστη
 * μία ακολουθία από το πολύ 30 ακέραιους αριθμούς, να απαλείφει από την
 * παραπάνω ακολουθία, όλες τις συνεχόμενες επαναλήψεις ίδιων αριθμών
 * και εκτυπώνει την ακολουθία που προκύπτει.
 * Λύση: Για να επιλύσουμε το πρόβλημα χρησιμοποιούμε δύο δείκτες τον i και j
 * δίνοντάς τους αρχικά τιμές i=0 και j=1. Μόλις βρούμε τον πρώτο όρο
 * στη θέση j που διαφέρει από τον όρο στη θέση i, τον αντιγράφουμε
 * στην θέση i+1. Αυξάνουμε το i κατά 1  και το j κατά 1 εφόσον το j δεν έχει
 * υπερβεί το πλήθος των στοιχείων επαναλαμβάνουμε από το προηγούμενο βήμα.
 * Έννοιες που συναντάμε: δείκτης, συνθήκη ελέγχου, βρόγχος επανάληψης, θέση μνήμης
 ****************************************************************************/
 
#include <stdio.h>
#include <stdlib.h>
#define MAX 30
main()
{
    int n,x;
    int i,j,k,a[MAX];
    printf("Apaleifh twn diadoxikwn idiwn stoixeiwn\n");
    printf("apo mia akolouthia me 30 to poly akeraioys.\n");
    printf("Dwse moy mexri 30 arithmous (-1 gia telos)\n");
    n=0; /* μήκος της ακολουθίας πριν ο χρήστης δώσει στοιχεία*/
    /* εισαγωγή αριθμών από το χρήστη μέχρι να δωθεί -1 */

    do{
        scanf("%d",&x);
        if (x!=-1)
        {
            a[n]=x;
            n=n+1;
        }
    }while ((x!= -1) && (n < MAX));
    i=0; /* δείχνει στον αριθμό που βρίσκεται στην πρώτη θέση της ακολουθίας */
    j=1; /* δείχνει στον αριθμό που βρίσκεται στην δεύτερη θέση της ακολουθίας */
    /* αν υπάρχουν στοιχεία στην ακολουθία */
    if (n > 0)
    {
        while (j<n) /* oso den exoume jeperasei thn teleytaia uesh ths akoloythias */
        {
            /* αν ο αριθμός της θέσης i είναι διαφορετικός από εκείνον
            της θέσης j αντιγράφουμε εκείνον της θέσης j στη θέση i+1 και
            αυξάνουμε το i κατά 1 */
            if (a[i]!=a[j])
            {
                i++;
                a[i]=a[j];
            }
            j++;
        }
        k=i+1; /* το πλήθος των στοιχείων του νέου πίνακα */
        printf("H nea akolouthia einai\n");
        for (i=0;i<k;i++)
        printf("%d ",a[i]);
        printf("\n");
    }
    else
    printf("H akolouthia poy moy edwses den exei kanena stoixeio\n");
    system("pause");
}


///ΕΙΣΟΔΟΣ: 6 4 4 4 555 5 8 8 7 7 5 5
///ΕΞΟΔΟΣ: 6 4 555 5 8 7 5
