/*****************************************************************************
 * ΠΛΗ10 
 * Εισαγωγή στη γλώσσα προγραμματισμού C.
 * 
 * 31o Αρχείο: 31_swapmatrix.c
 *
 * Αυτό είναι το τριακοστό πρώτο πρόγραμμα προς επίδειξη.
 * Πρόβλημα: Να υλοποιήσετε με δείκτες, πίνακα δύο διαστάσεων (nxn) τα στοιχεία
 * του οποίου θα είναι δείκτες σε αλφαριθμητικές ακολουθίες (strings).
 * Στη συνέχεια με τη χρήση προσωρινής μεταβλητής, τύπου δείκτη σε string,
 * θα αλλάζετε το περιεχόμενο των θέσεων του πίνακα (δηλαδή των διευθύνσεων
 * των δεικτών του), μεταθέτοντας το περιεχόμενο της πρώτης σειράς του πίνακα
 * στη δεύτερη και της δεύτερης στην πρώτη, της τρίτης στην τέταρτη και της
 * τέταρτης στην τρίτη, κ.ο.κ. Αυτό βέβαια προϋποθέτει ότι το πλήθους των
 * γραμμών του πίνακα θα είναι ζυγός αριθμός (2n). Επίσης πριν τη μεταφορά θα
 * ελέγχετε αν η αλφαριθμητική ακολουθία που πρέπει να μεταφέρετε είναι ίδια με
 * αυτή που θα μεταφερθεί στη θέση της. Σε αυτή την περίπτωση, αν είναι ίδια,
 * θα καλείτε τη συνάρτηση reverse() και θα αλλάζετε τη σειρά και των δύο
 * αλφαριθμητικών ακολουθιών, χωρίς να τους αλλάζετε τελικά θέση.
 * Τέλος το πρόγραμμα σας θα εκτυπώνει τα στοιχεία του πίνακα μετά την επεξεργασία. 
 * Λύση: Για την επίλυση του προβλήματος αρχικά γεμίζουμε ένα πίνακα με τις
 * διευθύνσεις των αλφαριθμητικών που διαβάζουμε από το πληκτρολόγιο. Κατόπιν
 * καλούμε την συνάρτηση swap δίνοντας τις διευθύνσεις των αλφαριθμητικών που
 * χρειάζεται να αλλαχτούν. Ο έλεγχος του προγράμματος περνά στην συνάρτηση
 * swap, η οποία αρχικά ελέγχει αν οι δύο ακολουθίες αλφαριθμητικών είναι ίδιες.
 * Αν είναι ίδιες καλέιται η συνάρτηση reverse, η οποία αλλάζει τη σειρά και
 * των δύο αλφαριθμητικών ακολουθιών, χωρίς να τους αλλάζει τελικά θέση. Αν όμως
 * δεν είναι ίδια, τότε αλλάζει το περιεχόμενο των θέσεων του πίνακα. Ο έλεγχος
 * του προγράμματος περνά και πάλι στη συνάρτηση main, όπου και γίνεται η εκτύπωση των στοιχείων του πίνακα.
 * Έννοιες που συναντάμε: δείκτης, πίνακες, βρόχος επανάληψης, δυναμική ανάθεση μνήμης, συναρτήσεις.
 ****************************************************************************/
 
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#define N 2
#define length 30

void swap(char *s, char *t);

void main()
{
	int i,j;

	char * matrix[N][N];

	for (i=0; i<N; i++)
		for (j=0; j<N; j++)
		{
			matrix[i][j]=(char *)malloc(length * sizeof(char));
			scanf("%s", matrix[i][j]);
		}

	for (i=0; i<N/2; i++)
		for (j=0; j<N; j++)
			swap(matrix[2*i][j],matrix[2*i+1][j]);

	for (i=0; i<N; i++)
	{
		for (j=0; j<N; j++) 
			printf("%s ", matrix[i][j]);

		printf("\n");
	}
	system("pause");
}

void reverse(char *s)
{ 
	int len,i; 
	char temp;
  
	len=strlen(s);
   
	for (i=0; i<len/2;i++)
	{
		temp=s[i];
		s[i]=s[len-1-i];
		s[len-1-i]=temp;
	}
}

void swap(char *s, char *t)
{ 
	char *temp;
	int flag=1, len1,len2, i;
  
	if (!strcmp(s,t))
	{
		reverse(s); 
		reverse(t);
	}
	else 
	{
		len1=strlen(s);
		len2=strlen(t);

		temp=(char *)malloc((len2+1)*sizeof(char));
		for (i=0; i<=len2; i++) 
			temp[i]=t[i];
			
		for (i=0; i<=len1; i++) 
			t[i]=s[i];  
		
		for (i=0; i<=len2; i++)  
			s[i]=temp[i];
    }
}
 
