/*****************************************************************************
 * ΠΛΗ10 
 * Εισαγωγή στη γλώσσα προγραμματισμού C.
 * 
 * 32o Αρχείο: 32_kremala.c
 *
 * Αυτό είναι το τριακοστό δεύτερο πρόγραμμα προς επίδειξη.
 * Πρόβλημα: Δημιουργείστε κώδικα ο οποίος υλοποιεί το ακόλουθο παιχνίδι:
 * αρχικά ζητείται από τον πρώτο χρήστη να εισαγάγει μια λέξη. Στη συνέχεια η οθόνη
 * καθαρίζεται και εμφανίζονται χαρακτήρες '_' στη θέση των γραμμάτων της λέξης καθώς
 * και ένας μετρητής που δηλώνει πόσες προσπάθειες απομένουν στο δεύτερο χρήστη,
 * που καλείται να μαντέψει τη λέξη δίνοντας έναν χαρακτήρα κάθε φορά. Αν ο
 * εισαγόμενος χαρακτήρας υπάρχει εμφανίζεται στην κατάλληλη θέση της λέξης, αν
 * δεν υπάρχει ο μετρητής μειώνεται κατά 1. Το παιχνίδι τελειώνει όταν βρεθούν όλα
 * τα γράμματα της λέξης ή όταν μηδενιστεί ο μετρητής. 
 * Προτείνεται: ο έλεγχος ύπαρξης ενός χαρακτήρα σε μια λέξη να γίνεται με την κλήση
 * συνάρτησης η οποία θα λαμβάνει ως ορίσματα τη λέξη και τον χαρακτήρα προς
 * αναζήτηση και θα επιστρέφει 0 αν δεν υπάρχει ή 1 αν υπάρχει. 
 * Υπόδειξη: Ο καθαρισμός της οθόνης γίνεται με την εντολή system("clear") (unix) ή system("cls") (DOS) 
 * Λύση:  Για την επίλυση του προβλήματος χρησιμοποιούμε ένα πίνακα χαρακτήρων 50 θέσεων
 * για την αρχική λέξη, ένα πίνακα χαρακτήρων 50 θέσεων για την υπό αναζήτηση λέξη
 * (τον οποίο αρχικοποιούμε με '-'), και μία μεταβλητή τύπου χαρακτήρα στην οποία αποθηκεύουμε
 * την τρέχουσα επιλογή του χρήστη 2. Αρχικά ζητείται από τον χρήστη 1 να πληκτρολογηθεί
 * η λέξη, η οποία αποθηκεύεται στον πρώτο πίνακα χαρακτήρων. Για κάθε χαρακτήρα που
 * πληκτρολογεί ο χρήστης 2, καλείται η συνάρτηση HandleGivenLetter, η οποία ελέγχει
 * τον χαρακτήρα που πληκτρολογήθηκε και επιστρέφει έναν ακέραιο που εκφράζει αν ο χαρακτήρας
 * υπάρχει στην κρυμμένη λέξη. Η συνάρτηση main τυπώνει τον χαρακτήρα που βρέθηκε ή μειώνει
 * τον αριθμό των αριθμό των προσπαθειών. Τέλος τυπώνει μήνυμα αποτυχίας ή επιτυχίας,
 * ανάλογα με το αν ο αριθμός των προσπαθειών έχει μηδενιστεί ή όχι.
 * Έννοιες που συναντάμε: δείκτης, συνθήκη ελέγχου, βρόγχος επανάληψης, συναρτήσεις
 ****************************************************************************/
 
#include <stdio.h>
#include <string.h>

int HandleGivenLetter(char KeyLetter, char *HidWord, char *RevWord)
{
    int i, lcount = 0;

    for (i = 0; i < strlen(HidWord); i++)
    {
        if (KeyLetter == RevWord[i]) // αν έχει ήδη βρεθεί τογραμμα(επειδή το πρότεινε σε προηγούμενο χρόνο ο χρήστης)επιστρέφουμε 0 εμφανίσεις
            break;
        else
            if (KeyLetter == HidWord[i])
            {
               RevWord[i] = KeyLetter;  // αν βρεθεί το γράμμα, το εμφανίζουμε στην RevWord
               lcount++; // και αυξάνουμε τον αριθμό των εμφανίσεών του
            }
    }

    return lcount;
}

int main()
{
    char hiddenWord[50], revealedWord[50], givenLetter;
    int i, HiddenChars, userpoints, LetterCount;
    userpoints = 10;

    printf("Xrhsth 1::Dwse thn Krymmenh Leksh: ");
    scanf("%s", hiddenWord);  // αποθηκεύουμε την κρυμμένη λέξη
    HiddenChars = strlen(hiddenWord);

    for(i=0; i < HiddenChars; i++) // βάζουμε '-' στην λέξη που θα δείχνουμε στον χρήστη 2
    {
           revealedWord[i] = '-';
    }
    \
    revealedWord[HiddenChars] = 0;
    //system("clear");

    while( userpoints > 0 && HiddenChars > 0)
    {
           printf("%s\t\tPoints Left %d\nXrhsth 2::Proteine kapoio gramma: \n", revealedWord, userpoints);
           scanf("\n%c", &givenLetter);

           LetterCount = HandleGivenLetter(givenLetter, hiddenWord, revealedWord);

           if (LetterCount)
           {
                printf("Bre8hkan %d '%c' sth leksh.\n", LetterCount, givenLetter);
                HiddenChars -= LetterCount; // μειώνουμε τον αριθμό των κρυμμένων χαρακτήρων
           }
           else
           {
                printf("Den bre8hkan '%c' sth leksh.\n", givenLetter);
                userpoints--;// αποτυχία σημαίνει μείωση των πόντων
           }
     }

     if (!HiddenChars)
     printf("Success!\n");

     else
     printf("Fail! ");

     printf("H krymmenh leksh htan: \"%s\" \n", hiddenWord); // και εμφάνιση της κρυμμένης λέξης

     return 0;
}
